[{"path":"brassbound-sketch","title":"Brassbound, A Usable Crypto Library","date":"January 31st, 2018","preview":"What if crypto libraries actually tried to help the developer using them, instead of being an incomprehensible pile of functions?"},{"path":"destructuring-explained","title":"Destructuring, Explained","date":"January 31st, 2018","preview":"Destructuring, also called structural binding, is a method of binding symbols to a set of values,\nwidely used in the lisp family of languages, and in a few other popular languages.\nDestructuring is most commonly associated with lists, although it works on arrays, objects, and hash tables as well.\nEssentially, you give a pattern or a template with variables, and a set of values to match against that pattern,\nand your language binds those variables to the corresponding values."},{"path":"moral-categories","title":"The Usage of Moral Categories in Academic Philosophy","date":"November 5th, 2017","preview":"A <em>long</em> time ago, something called morality entered into human consiousness,\npresumably, beaten into our long-dead ancestors to enforce rules formerly backed only in violence.\nIt occupies a layer between our emotional reactions to certain decisions,\nand our actual ability to make decisions.\nDefined in a philosophic terms, it&apos;s a mental system used to determine the value of decisions,\nand thus, to make decisions."},{"path":"parser-reader","title":"Syntax And Semantics in Lisp Readers","date":"January 31st, 2018","preview":"Lisp is touted for its ability to change syntax, even to the extent of compiling other languages, like forth, with only a few lines of code.\nFrom this, you might assume lisp has advanced parsing methods that allow it to accomplish this feat.\nIn truth, lisp readers use a far simpler way of parsing, functions dispatched on characters."},{"path":"racket-io","title":"Racket and Abstraction","date":"November 5th, 2017","preview":"Earlier today, I took part in a conversation about the lack of scanf in racket.\nA case was mentioned where some unlucky soul was trying to parse comma-seperated square-bracket\nlists in racket, and realized that scanf would have served better.\nOne poster asked how something so important could be missing, and derided racket as &quot;an academic language.&quot;\nMany solutions were presented in the conversation, of varying levels of generality."}]