{"content":"<h2 id=\"bio\">Bio</h2>\n<p>My name is Dylan Ball, and I live in Manhattan, KS, but I&#39;m potentially willing to relocate, depending on the location.</p>\n<p>I&#39;m interested in programming language research, type theory, security, and interface design.\nI dedicate most of my free time to writing Common Lisp, working both in and on the language;\nwith the goal of improving the ecosystem and language abstractions; generally making life easier for other developers.\nI maintain a large amount of open-source applications,\nmost of which are on <a href=\"https://github.com/arathnim/\">github</a>,\nand documented <a href=\"#/projects/\">here on this site</a>.</p>\n<h2 id=\"things-i-m-good-at\">Things I&#39;m good at</h2>\n<h4 id=\"programming-languages-domain-specific-languages\">Programming Languages &amp; Domain Specific Languages</h4>\n<p>I&#39;ve spent a lot of time turning complicated problems into slightly less complicated ones,\nby building languages that allow programmers to easier manipulate elements of that domain.\nExamples include <a href=\"#\">a command-line parsing language</a>,\n<a href=\"#\">a language that provides binding, matching, and destructuring</a>,\nand the <a href=\"#\">Wvyern programming language</a>.</p>\n<h4 id=\"web-applications-and-apis\">Web applications and APIs</h4>\n<p>I have experience with both front-end and back-end web tech, and know how to design user-friendly applications and strong, stable APIs.</p>\n<h4 id=\"libraries-and-developer-tooling\">Libraries and developer tooling</h4>\n<p>I dedicate most of my free time to developing and maintaining open source software,\nwriting and documenting watertight abstractions that can be used and reused.\nI approach library interfaces from a user experience perspective as well as a technical one.</p>\n<h4 id=\"teaching-and-technical-writing\">Teaching and technical writing</h4>\n<p>I like explaining things, and I know how to make complex topics accessible,\nboth in writing and in person. I write this blog, and document all of my software extensively.</p>\n<h2 id=\"things-i-like-to-use\">Things I like to use</h2>\n<h4 id=\"common-lisp\">Common Lisp</h4>\n<p>transforms package</p>\n<h4 id=\"javascript\">JavaScript</h4>\n<h2 id=\"projects-i-m-working-on\">Projects I’m working on</h2>\n<h4 id=\"the-wyvern-programming-language\">The Wyvern programming language</h4>\n<h2 id=\"contact\">Contact</h2>\n","data":{},"excerpt":""}